In [1]:
import pandas as pd

In [3]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [5]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [7]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [9]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [11]:
pd.merge(employees, departments, on='DeptID')

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [13]:
pd.merge(employees, departments, on='DeptID', how='left')

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [15]:
pd.merge(employees, departments, on='DeptID', how='right')

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [17]:
pd.merge(employees, departments, on='DeptID', how='outer')

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [27]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "age": ['19','20']})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "Sub":['Eng', 'MT']})

In [29]:
df1

    Name age
0  Alice  19
1    Bob  20

In [31]:
df2

      Name  Sub
0  Charlie  Eng
1    David   MT

In [33]:
pd.concat([df1, df2])

      Name  age  Sub
0    Alice   19  NaN
1      Bob   20  NaN
0  Charlie  NaN  Eng
1    David  NaN   MT

In [35]:
pd.concat([df1, df2],axis=1)

    Name age     Name  Sub
0  Alice  19  Charlie  Eng
1    Bob  20    David   MT